PhilipEkholm/DA346A-Laborationer/lab5/app/defines/m2560.inc
; PING - Input Pins, Port G
.equ	PING0	= 0	;
.equ	PING1	= 1	;
.equ	PING2	= 2	;
.equ	PING3	= 3	;
.equ	PING4	= 4	;
.equ	PING5	= 5	;


; ***** PORTH ************************
; PORTH - PORT H Data Register
.equ	PORTH0	= 0	; PORT H Data Register bit 0
.equ	PH0	= 0	; For compatibility
.equ	PORTH1	= 1	; PORT H Data Register bit 1
.equ	PH1	= 1	; For compatibility
.equ	PORTH2	= 2	; PORT H Data Register bit 2
.equ	PH2	= 2	; For compatibility
.equ	PORTH3	= 3	; PORT H Data Register bit 3
.equ	PH3	= 3	; For compatibility
.equ	PORTH4	= 4	; PORT H Data Register bit 4
.equ	PH4	= 4	; For compatibility
.equ	PORTH5	= 5	; PORT H Data Register bit 5
.equ	PH5	= 5	; For compatibility
.equ	PORTH6	= 6	; PORT H Data Register bit 6
.equ	PH6	= 6	; For compatibility
.equ	PORTH7	= 7	; PORT H Data Register bit 7
.equ	PH7	= 7	; For compatibility

; DDRH - PORT H Data Direction Register
.equ	DDH0	= 0	; PORT H Data Direction Register bit 0
.equ	DDH1	= 1	; PORT H Data Direction Register bit 1
.equ	DDH2	= 2	; PORT H Data Direction Register bit 2
.equ	DDH3	= 3	; PORT H Data Direction Register bit 3
.equ	DDH4	= 4	; PORT H Data Direction Register bit 4
.equ	DDH5	= 5	; PORT H Data Direction Register bit 5
.equ	DDH6	= 6	; PORT H Data Direction Register bit 6
.equ	DDH7	= 7	; PORT H Data Direction Register bit 7

; PINH - PORT H Input Pins
.equ	PINH0	= 0	; PORT H Input Pins bit 0
.equ	PINH1	= 1	; PORT H Input Pins bit 1
.equ	PINH2	= 2	; PORT H Input Pins bit 2
.equ	PINH3	= 3	; PORT H Input Pins bit 3
.equ	PINH4	= 4	; PORT H Input Pins bit 4
.equ	PINH5	= 5	; PORT H Input Pins bit 5
.equ	PINH6	= 6	; PORT H Input Pins bit 6
.equ	PINH7	= 7	; PORT H Input Pins bit 7


; ***** PORTJ ************************
; PORTJ - PORT J Data Register
.equ	PORTJ0	= 0	; PORT J Data Register bit 0
.equ	PJ0	= 0	; For compatibility
.equ	PORTJ1	= 1	; PORT J Data Register bit 1
.equ	PJ1	= 1	; For compatibility
.equ	PORTJ2	= 2	; PORT J Data Register bit 2
.equ	PJ2	= 2	; For compatibility
.equ	PORTJ3	= 3	; PORT J Data Register bit 3
.equ	PJ3	= 3	; For compatibility
.equ	PORTJ4	= 4	; PORT J Data Register bit 4
.equ	PJ4	= 4	; For compatibility
.equ	PORTJ5	= 5	; PORT J Data Register bit 5
.equ	PJ5	= 5	; For compatibility
.equ	PORTJ6	= 6	; PORT J Data Register bit 6
.equ	PJ6	= 6	; For compatibility
.equ	PORTJ7	= 7	; PORT J Data Register bit 7
.equ	PJ7	= 7	; For compatibility

; DDRJ - PORT J Data Direction Register
.equ	DDJ0	= 0	; PORT J Data Direction Register bit 0
.equ	DDJ1	= 1	; PORT J Data Direction Register bit 1
.equ	DDJ2	= 2	; PORT J Data Direction Register bit 2
.equ	DDJ3	= 3	; PORT J Data Direction Register bit 3
.equ	DDJ4	= 4	; PORT J Data Direction Register bit 4
.equ	DDJ5	= 5	; PORT J Data Direction Register bit 5
.equ	DDJ6	= 6	; PORT J Data Direction Register bit 6
.equ	DDJ7	= 7	; PORT J Data Direction Register bit 7

; PINJ - PORT J Input Pins
.equ	PINJ0	= 0	; PORT J Input Pins bit 0
.equ	PINJ1	= 1	; PORT J Input Pins bit 1
.equ	PINJ2	= 2	; PORT J Input Pins bit 2
.equ	PINJ3	= 3	; PORT J Input Pins bit 3
.equ	PINJ4	= 4	; PORT J Input Pins bit 4
.equ	PINJ5	= 5	; PORT J Input Pins bit 5
.equ	PINJ6	= 6	; PORT J Input Pins bit 6
.equ	PINJ7	= 7	; PORT J Input Pins bit 7


; ***** PORTK ************************
; PORTK - PORT K Data Register
.equ	PORTK0	= 0	; PORT K Data Register bit 0
.equ	PK0	= 0	; For compatibility
.equ	PORTK1	= 1	; PORT K Data Register bit 1
.equ	PK1	= 1	; For compatibility
.equ	PORTK2	= 2	; PORT K Data Register bit 2
.equ	PK2	= 2	; For compatibility
.equ	PORTK3	= 3	; PORT K Data Register bit 3
.equ	PK3	= 3	; For compatibility
.equ	PORTK4	= 4	; PORT K Data Register bit 4
.equ	PK4	= 4	; For compatibility
.equ	PORTK5	= 5	; PORT K Data Register bit 5
.equ	PK5	= 5	; For compatibility
.equ	PORTK6	= 6	; PORT K Data Register bit 6
.equ	PK6	= 6	; For compatibility
.equ	PORTK7	= 7	; PORT K Data Register bit 7
.equ	PK7	= 7	; For compatibility

; DDRK - PORT K Data Direction Register
.equ	DDK0	= 0	; PORT K Data Direction Register bit 0
.equ	DDK1	= 1	; PORT K Data Direction Register bit 1
.equ	DDK2	= 2	; PORT K Data Direction Register bit 2
.equ	DDK3	= 3	; PORT K Data Direction Register bit 3
.equ	DDK4	= 4	; PORT K Data Direction Register bit 4
.equ	DDK5	= 5	; PORT K Data Direction Register bit 5
.equ	DDK6	= 6	; PORT K Data Direction Register bit 6
.equ	DDK7	= 7	; PORT K Data Direction Register bit 7

; PINK - PORT K Input Pins
.equ	PINK0	= 0	; PORT K Input Pins bit 0
.equ	PINK1	= 1	; PORT K Input Pins bit 1
.equ	PINK2	= 2	; PORT K Input Pins bit 2
.equ	PINK3	= 3	; PORT K Input Pins bit 3
.equ	PINK4	= 4	; PORT K Input Pins bit 4
.equ	PINK5	= 5	; PORT K Input Pins bit 5
.equ	PINK6	= 6	; PORT K Input Pins bit 6
.equ	PINK7	= 7	; PORT K Input Pins bit 7


; ***** PORTL ************************
; PORTL - PORT L Data Register
.equ	PORTL0	= 0	; PORT L Data Register bit 0
.equ	PL0	= 0	; For compatibility
.equ	PORTL1	= 1	; PORT L Data Register bit 1
.equ	PL1	= 1	; For compatibility
.equ	PORTL2	= 2	; PORT L Data Register bit 2
.equ	PL2	= 2	; For compatibility
.equ	PORTL3	= 3	; PORT L Data Register bit 3
.equ	PL3	= 3	; For compatibility
.equ	PORTL4	= 4	; PORT L Data Register bit 4
.equ	PL4	= 4	; For compatibility
.equ	PORTL5	= 5	; PORT L Data Register bit 5
.equ	PL5	= 5	; For compatibility
.equ	PORTL6	= 6	; PORT L Data Register bit 6
.equ	PL6	= 6	; For compatibility
.equ	PORTL7	= 7	; PORT L Data Register bit 7
.equ	PL7	= 7	; For compatibility

; DDRL - PORT L Data Direction Register
.equ	DDL0	= 0	; PORT L Data Direction Register bit 0
.equ	DDL1	= 1	; PORT L Data Direction Register bit 1
.equ	DDL2	= 2	; PORT L Data Direction Register bit 2
.equ	DDL3	= 3	; PORT L Data Direction Register bit 3
.equ	DDL4	= 4	; PORT L Data Direction Register bit 4
.equ	DDL5	= 5	; PORT L Data Direction Register bit 5
.equ	DDL6	= 6	; PORT L Data Direction Register bit 6
.equ	DDL7	= 7	; PORT L Data Direction Register bit 7

; PINL - PORT L Input Pins
.equ	PINL0	= 0	; PORT L Input Pins bit 0
.equ	PINL1	= 1	; PORT L Input Pins bit 1
.equ	PINL2	= 2	; PORT L Input Pins bit 2
.equ	PINL3	= 3	; PORT L Input Pins bit 3
.equ	PINL4	= 4	; PORT L Input Pins bit 4
.equ	PINL5	= 5	; PORT L Input Pins bit 5
.equ	PINL6	= 6	; PORT L Input Pins bit 6
.equ	PINL7	= 7	; PORT L Input Pins bit 7


